{
  "secondary_objectives": {
    "description": "Encounters with a parallel objective that require PCs to take actions other than destroying foes can keep those foes around long enough to do interesting things without inflating their power level. It also gives PCs skilled in areas related to the side mission a chance to shine. Sometimes a secondary objective might present a time limit, like if the PCs need to prevent evidence from being burned, either by fighting quickly or by actively protecting the documents. Another type of secondary objective relates to how the PCs engage in combat with the primary opposition. The PCs might need to use nonlethal attacks against guards who mistakenly believe the PCs are criminals, or they might need to prevent slippery scouts from retreating to alert others. Options like these highlight mobile characters like the monk. You could even create truly off-the-wall secondary objectives that require the PCs to lose."
  },
  "synergy_and_coordination": {
    "description": "At the opposite end of the spectrum, opponents with poor coordination make the fight much easier for the PCs. Poor coordination between mindless creatures is common, and PCs can use clever tactics to run circles around these foes. When intelligent creatures accidentally (or deliberately) harm each other or pursue conflicting strategies, particularly if they engage in banter with each other as they fight, it can make for an amusing break in the typical rhythm of combat. When taken to its extreme, synergy can represent the actions of a hive mind or a single massive creature. These synergistic components can be creatures, hazards, or both. For example, instead of representing a kraken the size of a warship as a single foe, you could represent each of its tentacles as an individual opponent. Perhaps the kraken can sacrifice actions it would otherwise use to crush PCs in its maw to use its tentacles more freely. In this case, you could model a field of tentacles as a complex hazard that mainly reacts to the PCs moving."
  },
  "misdirection": {
    "description": "Setting up the battle map can also go a long way to misdirect your players—or at least avoid accidentally telegraphing what an encounter will be. For instance, if you always put out statue minis whenever there are statues in the room, the PCs might at first be overly suspicious of ordinary statues, but they will be more surprised later on when a statue turns out to be a construct than if you place minis only when the statue is actually a construct."
  }
}